#### PointCloudColorMode Enumeration

---

|  |
| --- |
| See Also |

Color mode of a point cloud or part of a point cloud

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum PointCloudColorMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PointCloudColorMode ``` |

| Visual C++ |
| --- |
| ``` public enum class PointCloudColorMode ``` |

# Members

| Member name | Description |
| --- | --- |
| NoOverride | Show the actual colors |
| FixedColor | Show a single color |
| Elevation | Color by elevation |
| Intensity | Color by intensity (reflectivity) |
| Normals | Color by normal vectors |

# See Also

Autodesk.Revit.DB Namespace